Giacomo-Spano/ESP8266Webduino/Shield.cpp
#include "Shield.h"
#include "DoorSensor.h"
#include "HornSensor.h"
#include "Logger.h"
#include "Command.h"
#include "ESP8266Webduino.h"
#ifdef ESP8266
#include <Adafruit_ST7735.h>
#endif
#include "SensorFactory.h"

#include <ArduinoJson.h>          //https://github.com/bblanchon/ArduinoJson

extern void resetWiFiManagerSettings();
extern bool mqtt_publish(String topic, String message);
extern void reboot(String reason);

Logger Shield::logger;
String Shield::tag = "Shield";

Shield::Shield()
{
	lastRestartDate = "";
	swVersion = "1.73";

	id = 0; //// inizializzato a zero perch� viene impostato dalla chiamata a registershield
	localPort = 80;
	serverName = "giacomohome.ddns.net";
	mqttServer = "giacomohome.ddns.net";
	mqttPort = 1883;
	serverPort = 8080;
	shieldName = "shieldName";
	mqttUser = "";
	mqttPassword = "";
	mqttMode = true;// true;
	configMode = false;// true;
	resetSettings = false;// true;
	powerStatus = "on"; // da aggiungere
	lastCheckHealth = 0;
	rebootreason = "unknown";
}

Shield::~Shield()
{
	sensorList.clearAll();
}

void Shield::writeConfig() {

	logger.println(tag, F(">>writeConfig"));
	DynamicJsonBuffer jsonBuffer;
	JsonObject& json = jsonBuffer.createObject();
	json["http_server"] = getServerName();
	json["http_port"] = getServerPort();
	json["mqtt_server"] = getMQTTServer();
	json["mqtt_port"] = getMQTTPort();
	json["mqtt_user"] = getMQTTUser();
	json["mqtt_password"] = getMQTTPassword();
	json["resetsettings"] = getResetSettings();
	json["shieldid"] = getShieldId();

	File configFile = SPIFFS.open("/config.json", "w");
	if (!configFile) {
		logger.print(tag, F("<<writeConfig"));
		return;
	}

	json.printTo(Serial);
	json.printTo(configFile);
	configFile.close();
	logger.println(tag, F("config file writtten"));
	logger.println(tag, F("<<writeConfig"));
}

void Shield::readConfig() {

	logger.println(tag, F(">>readConfig"));

	if (SPIFFS.begin()) {
		logger.print(tag, F("\n\t mounted file system"));
		if (SPIFFS.exists("/config.json")) {
			//file exists, reading and loading
			logger.print(tag, F("\n\t reading config file"));
			File configFile = SPIFFS.open("/config.json", "r");
			if (configFile) {
				logger.print(tag, F("\n\t opened config file"));
				size_t size = configFile.size();
				// Allocate a buffer to store contents of the file.
				std::unique_ptr<char[]> buf(new char[size]);
				configFile.readBytes(buf.get(), size);
				DynamicJsonBuffer jsonBuffer;
				JsonObject& json = jsonBuffer.parseObject(buf.get());
				json.printTo(Serial);
				if (json.success()) {
					logger.print(tag, F("\n\t parsed json"));

					if (json.containsKey("http_server")) {
						logger.print(tag, F("\n\t http_server: "));
						String str = json["http_server"];
						logger.print(tag, str);
						setServerName(str);
					}
					if (json.containsKey("http_port")) {
						logger.print(tag, F("\n\t http_port: "));
						String str = json["http_port"];
						logger.print(tag, str);
						setServerPort(json["http_port"]);
					}
					if (json.containsKey("mqtt_server")) {
						logger.print(tag,"\n\t mqtt_server: ");
						String str = json["mqtt_server"];
						logger.print(tag, str);
						setMQTTServer(json["mqtt_server"]);
					}
					if (json.containsKey("mqtt_port")) {
						logger.print(tag, F("\n\t mqtt_port: "));
						String str = json["mqtt_port"];
						logger.print(tag, str);
						setMQTTPort(json["mqtt_port"]);
					}
					if (json.containsKey("mqtt_user")) {
						logger.print(tag, F("\n\t mqtt_user: "));
						String str = json["mqtt_user"];
						logger.print(tag, str);
						setMQTTUser(json["mqtt_user"]);
					}
					if (json.containsKey("mqtt_password")) {
						logger.print(tag, F("\n\t mqtt_password: "));
						String str = json["mqtt_password"];
						logger.print(tag, str);
						setMQTTPassword(json["mqtt_password"]);
					}
					if (json.containsKey("shieldid")) {
						logger.print(tag, F("\n\t shieldid: "));
						String str = json["shieldid"];
						logger.print(tag, str);
						setShieldId(json["shieldid"]);
					}
					if (json.containsKey("resetsettings")) {
						logger.print(tag, F("\n\t resetsettings: "));
						bool enabled = json["resetsettings"];
						logger.print(tag, Logger::boolToString(enabled));
						setResetSettings(json["resetsettings"]);
					}
				}
				else {
					logger.print(tag, F("\n\t failed to load json config"));
					//clean FS, for testing
					SPIFFS.format();
					writeConfig();
				}
			}
		}
	}
	else {
		logger.print(tag, F("failed to mount FS"));
	}
	logger.print(tag, F("<<readConfig"));
}


void Shield::init() {
	//tftDisplay.init();
	//display.init();
	status = "restart";
	shieldEvent = "";

	espDisplay.init(D3, D4);
}

void Shield::clearAllSensors() {

	sensorList.clearAll();
}

Sensor* Shield::getSensorFromAddress(String addr) {
	for (int i = 0; i < sensorList.count; i++) {
		Sensor* sensor = (Sensor*)sensorList.get(i);
		if (sensor->address == addr)
			return sensor;
	}
	return nullptr;
}

Sensor* Shield::getSensorFromId(int id) { /// sidsogna aggiungere anche richerca nei child
	for (int i = 0; i < sensorList.count; i++) {
		Sensor* sensor = (Sensor*)sensorList.get(i);
		if (sensor->sensorid == id) {
			return sensor;
		}
		for (int k = 0; k < sensor->childsensors.length(); k++) {
			Sensor* child = (Sensor*)sensor->childsensors.get(k);
			if (child->sensorid == id) {
				return (Sensor*)child;
			}
		}
	}
	return nullptr;
}


void Shield::drawStatus() {
	espDisplay.drawString(0, 0, status);
}

void Shield::drawMemory() {
	espDisplay.drawString(50, 0, "(" + String(freeMemory) + ")");
}

void Shield::drawEvent() {

	espDisplay.drawString(0, 10, shieldEvent);
}

void Shield::drawSWVersion() {

	String txt = logger.getStrDate();
	espDisplay.drawString(100, 0, "v" + swVersion);
}

void Shield::drawDateTime() {

	String txt = logger.getStrDate();
	espDisplay.drawString(0, 20, txt);
}

void Shield::drawSensorsStatus() {

	int lines = 3;
	for (int i = 0; i < sensorList.count; i++) {

		Sensor* sensor = (Sensor*)sensorList.get(i);
		if (!sensor->enabled)
			continue;
		String txt = sensor->sensorname.substring(0, 5);
		espDisplay.drawString(0, lines++ * 10, txt + ": " + String(sensor->getStatusText()));
		for (int k = 0; k < sensor->childsensors.length(); k++) {
			
