Giacomo-Spano/ESP8266Webduino/Shield.cpp
			Sensor* child = (Sensor*)sensor->childsensors.get(k);
			txt = child->sensorname.substring(0, 5);
			espDisplay.drawString(0, lines++ * 10, txt + ": " + String(child->getStatusText()));
		}
	}
}

void Shield::drawString(int x, int y, String txt, int size, int color) {

	//tftDisplay.drawString(x, y, txt, 1, ST7735_WHITE);
	//tftDisplay.drawString(int row, int col, String txt, int size, int color);
}

/*Just as a heads up, to use the "drawXBitmap" function, I also had
to redefine the array from "static unsigned char" to "static const uint8_t PROGMEM"
in my image file.If I just used the original file, then garbage would appear on my 32x32 gird.
I think the array has to be defined as "PROGMEM" because the "drawXBitmap" function uses the
"pgm_read_byte" function, which reads a byte from program memory.I also had to include
the line "#include <avr/pgmspace.h>".After that, everything worked fine for me.*/

//#include <avr/pgmspace.h>
#define temperature_width 32
#define temperature_height 32
static const uint8_t PROGMEM temperature_bits[] = {
	0x00, 0x80, 0x01, 0x00, 0x00, 0xe0, 0x07, 0x00, 0x00, 0x70, 0x0e, 0x00,
	0x00, 0x18, 0x18, 0x00, 0x00, 0x08, 0x18, 0x00, 0x00, 0x18, 0x18, 0x00,
	0x00, 0x18, 0x10, 0x00, 0x00, 0x78, 0x10, 0x00, 0x00, 0x18, 0x10, 0x00,
	0x00, 0x18, 0x10, 0x00, 0x00, 0x78, 0x10, 0x00, 0x00, 0x18, 0x10, 0x00,
	0x00, 0x08, 0x10, 0x00, 0x00, 0xc8, 0x13, 0x00, 0x00, 0xc8, 0x13, 0x00,
	0x00, 0xc8, 0x13, 0x00, 0x00, 0xc8, 0x13, 0x00, 0x00, 0xc8, 0x13, 0x00,
	0x00, 0xc8, 0x13, 0x00, 0x00, 0xc8, 0x13, 0x00, 0x00, 0xcc, 0x33, 0x00,
	0x00, 0xc4, 0x23, 0x00, 0x00, 0xe6, 0x67, 0x00, 0x00, 0xe2, 0x67, 0x00,
	0x00, 0xe6, 0x67, 0x00, 0x00, 0xe6, 0x67, 0x00, 0x00, 0xe6, 0x67, 0x00,
	0x00, 0xce, 0x71, 0x00, 0x00, 0x0c, 0x30, 0x00, 0x00, 0x3c, 0x3c, 0x00,
	0x00, 0xf0, 0x0f, 0x00, 0x00, 0xc0, 0x03, 0x00 };

void Shield::clearScreen() {
	//tftDisplay.clear();

	//tftDisplay.drawXBitmap(90, 50, temperature_bits, temperature_width, temperature_height, 0xF800/*ST3577_RED*/);
}

void Shield::parseMessageReceived(String topic, String message) {

	String str = String(F("fromServer/shield/")) + getMACAddress();

	if (topic.equals(str + F("/settings"))) {
		logger.print(tag, F("\n\t received shield settings\n"));
		logger.print(tag, message);
		logger.print(tag, F("\n"));
		setEvent(F("<-received settings"));

		size_t size = message.length();
		DynamicJsonBuffer jsonBuffer;
		JsonObject& json = jsonBuffer.parseObject(message);
		if (json.success()) {
			logger.print(tag, F("\n\t settings= \n"));
			logger.printJson(json);
		}
		else {
			logger.print(tag, F("failed to load json config"));
			return;
		}
		setRebootReason("unknown");		
		if (loadSensors(json)) {
			writeSensorToFile(json);
			settingFromServerReceived = true;
			Command command;
			DynamicJsonBuffer jsonBuffer;
			JsonObject& json = jsonBuffer.createObject();
			getJson(json);
			String str;
			json.printTo(str);
			command.sendShieldStatus(str);
		}
	}
	else if (topic.equals(str + F("/reboot"))) {
		logger.print(tag, F("\n\t received reboot request"));
		setEvent(F("<-received reboot request"));
		reboot("reboot command");
	}
	else if (topic.equals(str + F("/resetsettings"))) {
		logger.print(tag, F("\n\t RESET SETTINGS!!!!!!!!!!!!!!!!"));
		setResetSettings(true);
		writeConfig();
		reboot("reset");
	}
	else if (topic.equals(str + F("/time"))) { // risposta a time
		logger.print(tag, F("\n\t received time"));
		setEvent(F("<-received time"));

		lastTimeRequest = millis();
		timeNeedToBeUpdated = false;
		bool timeRequestInprogress = false;

		time_t t = (time_t)atoll(message.c_str());
		logger.print(tag, F("\n\t time="));
		logger.print(tag, String(t));
		setTime(t);
	}
	else if (topic.equals(str + F("/command"))) {
		logger.print(tag, F("\n\t received command "));
		logger.print(tag, message);
		setEvent(F("<-received command"));
		receiveCommand(message);
	}
	
	else {
		logger.print(tag, F("\n\t PARSE NOT FOUND"));
	}
	logger.printFreeMem(tag, F("parseMessageReceived"));
	logger.print(tag, F("\n\t <<parseMessageReceived"));
}

bool Shield::receiveCommand(String jsonStr) {

	logger.print(tag, F("\n\t >>Shield::receiveCommand"));
	logger.print(tag, jsonStr);

	DynamicJsonBuffer jsonBuffer;
	JsonObject& json = jsonBuffer.parseObject(jsonStr);
	if (json.success()) {
		logger.print(tag, F("\n\t command= \n"));
		logger.printJson(json);
	}
	else {
		logger.print(tag, F("\n\t failed to load json config"));
		return false;
	}

	if (json.containsKey("command")) {
		bool result = false;
		String command = json["command"];
		logger.print(tag, F("\n\t command="));
		logger.print(tag, command);
		setEvent("<-received command " + command);
		if (command.equals(F("shieldsettings"))) { // risposta a loadsettting
			result = onShieldSettingsCommand(json);
			logger.print(tag, "\n\t <<receiveCommand result=" + String(result));
			return result;
		}
		else if (command.equals(F("power"))) { // ??
			result = onPowerCommand(json);
			logger.print(tag, F("\n\t <<receiveCommand result="));
			logger.print(tag, String(result));
			return result;
		}
		/*else if (command.equals(F("resetsettings"))) { // che differenza c'è tra reboot e reset?
			result = onResetSettingsCommand();
			//result = onRebootCommand(json);
			logger.print(tag, F("\n\t <<receiveCommand result="));
			logger.print(tag, String(result));
			return result;
		}
		else if (command.equals(F("reboot"))) { // che differenza c'è tra reboot e reset?
			result = onRebootCommand();
			logger.print(tag, F("\n\t <<receiveCommand result="));
			logger.print(tag, String(result));
			return result;
		}*/
		else if (command.equals(F("checkhealth"))) {
			logger.printFreeMem(tag, F("++checkhealth"));

			// uuid
			String uuid = "";
			if (json.containsKey("uuid")) {
				String str = json["uuid"];
				uuid = str;
				logger.print(tag, F("\n\t uuid="));
				logger.print(tag, uuid);
			}
			else {
				logger.print(tag, F("\n\t uuid NOT FOUND!"));
				return false;
			}

			lastCheckHealth = millis();
			String topic = "toServer/response/" + uuid + "/success";
			DynamicJsonBuffer jsonBuffer;
			JsonObject& json = jsonBuffer.createObject();
			getJson(json);
			String str;
			json.printTo(str);
			bool res = mqtt_publish(topic, str);

			logger.print(tag, F("\n\t <<receiveCommand result="));
			logger.print(tag, String(result));
			return res;
		}
		else if (json.containsKey("actuatorid") && json.containsKey("uuid")) {	// se c'è il campo actuatorid

			logger.print(tag, F("\n\treceived actuator command"));
			int id = json["actuatorid"];
			logger.print(tag, F("\n\t actuatorid="));
			logger.print(tag, String(id));
			String uuid = json["uuid"];
			Sensor* sensor = getSensorFromId(id);
			if (sensor != nullptr) {
				setEvent(F("<-received sensor command "));
				setEvent(command);
				return sensor->receiveCommand(command, id, uuid, jsonStr);
			}
			else {
				logger.print(tag, F("\n\t sensor not found"));
				logger.print(tag, F("\n\t <<receiveCommand result"));
			}
		}
	}
	logger.printFreeMem(tag, F("--receiveCommand"));
	logger.print(tag, F("\n\t <<Shield::receiveCommand"));
	return false;
}

bool Shield::onShieldSettingsCommand(JsonObject& json)
{
	logger.print(tag, F("\n\t>>onShieldSettingsCommand"));

