Giacomo-Spano/ESP8266Webduino/Shield.cpp
	if (json.containsKey("localport")) {
		int localPortr = json["localport"];
		//logger.print(tag, "\n\t localport=" + localPort);
		setLocalPort(localPort);
	}
	if (json.containsKey("shieldname")) {
		String name = json["shieldname"];
		//logger.print(tag, "\n\t shieldname=" + name);
		setShieldName(name);
	}
	if (json.containsKey("servername")) {
		String name = json["servername"];
		//logger.print(tag, "\n\t servername=" + name);
		setServerName(name);
	}
	if (json.containsKey("serverport")) {
		int serverPort = json["serverport"];
		//logger.print(tag, "\n\t serverport=" + serverPort);
		setServerPort(serverPort);
	}
	//writeEPROM();

	logger.print(tag, F("\n\t <<onShieldSettingsCommand"));
	return true;
}


/*bool Shield::onRebootCommand()
{
	logger.print(tag, F("\n\t>> onRebootCommand"));
	//ESP.restart();
	reboot("onReboot command");
	return true;
}*/

/*bool Shield::onResetSettingsCommand()
{
	logger.print(tag, F("\n\t>> onResetSettingsCommand"));
	resetWiFiManagerSettings();
	return true;
}*/

bool Shield::onPowerCommand(JsonObject& json)
{
	logger.print(tag, F("\n\t>> onPowerCommand"));
	bool res = false;

	if (json.containsKey("status")) {
		String status = json["status"];
		//logger.print(tag, "\n\t status=" + status);

		if (status.equals(F("on"))) {
			setPowerStatus(status);
			res = true;
		}
		else if (status.equals(F("off"))) {
			setPowerStatus(status);
			res = true;
		}
	}
	logger.print(tag, F("\n\t<< onPowerCommand"));
	return true;
}

void Shield::getJson(JsonObject& json) {
	logger.print(tag, F("\n\t >>Shield::getJson"));
	json["MAC"] = getMACAddress();
	json["swversion"] = swVersion;
	json["lastreboot"] = lastRestartDate;
	json["lastcheckhealth"] = String(lastCheckHealth);
	json["freemem"] = String(freeMemory);
	json["localIP"] = localIP;
	json["localPort"] = String(Shield::getLocalPort());
	logger.print(tag, F("\n\t <<Shield::getJson json="));
	logger.printJson(json);
}

/*String Shield::getJson() {

	logger.print(tag, F("\n\t >>Shield::getJson"));

	// andrebbe trasformato in JSONObject
	String str = "{";

	str += "\"MAC\":\"" + getMACAddress() + "\"";
	str += ",\"swversion\":\"" + swVersion + "\"";
	str += ",\"lastreboot\":\"" + lastRestartDate + "\"";
	str += ",\"lastcheckhealth\":\"" + String(lastCheckHealth) + "\"";
	str += ",\"freemem\":\"" + String(freeMemory) + "\"";
	str += ",\"localIP\":\"" + localIP + "\"";
	str += ",\"localPort\":\"" + String(Shield::getLocalPort()) + "\"";
	str += "}";
	
	logger.print(tag, F("\n\t <<Shield::getJson json="));
	logger.print(tag, str);
	return str;
}*/

void Shield::setStatus(String txt) {
	if (status.equals(txt))
		return;
	status = txt;
	invalidateDisplay();
}

void Shield::setEvent(String txt) {
	if (shieldEvent.equals(txt))
		return;
	shieldEvent = txt;
	invalidateDisplay();
}

void Shield::invalidateDisplay() {
	espDisplay.clear();

	drawStatus();
	drawMemory();
	drawSWVersion();
	drawEvent();
	drawDateTime();
	drawSensorsStatus();
	espDisplay.update();
}

void Shield::setFreeMem(int mem)
{
	freeMemory = mem;
}

void Shield::checkStatus()
{
	checkSensorsStatus();

	unsigned long currMillis = millis();
	unsigned long timeDiff = currMillis - lastTimeUpdate;

	if (timeDiff > 1000) {
		lastTimeUpdate = currMillis;

		invalidateDisplay();
	}


	/*display.clear();
	uint32_t getVcc = ESP.getVcc();// / 1024;
	String voltage = "Vcc " + String(getVcc) + "V";

	display.drawString(0, 0, Logger::getStrTimeDate() + " ", ArialMT_Plain_16);
	display.drawString(20, 16, Logger::getStrDayDate() + " ", ArialMT_Plain_10);
	display.drawString(0, 26, hearterActuator.getStatusName() + " " + String(hearterActuator.getReleStatus()) + voltage, ArialMT_Plain_10);
	for (int i = 0; i < sensorList.count; i++) {
		DS18S20Sensor* pSensor = (DS18S20Sensor*)sensorList.get(i);
		display.drawString(0, 16 + 10 + 10 + 10*(i), pSensor->sensorname + " " + pSensor->getTemperature(), ArialMT_Plain_10);
	}
	display.update();*/

}

void Shield::checkSensorsStatus()
{
	bool sensorStatusChanged = false;

	for (int i = 0; i < sensorList.count; i++) {

		Sensor* sensor = (Sensor*)sensorList.get(i);
		if (!sensor->enabled)
			continue;

		bool sendUpdate = false;

		bool res = sensor->checkStatusChange();
		if (res) {
			sendUpdate = true;
			setEvent(F("SENSOR STATUS CHANGED"));
			logger.println(tag, F("SENSOR STATUS CHANGED "));
			logger.print(tag, F("\n\t sensor "));
			logger.print(tag, sensor->sensorid);
			logger.print(tag, F("."));
			logger.print(tag, sensor->sensorname);
			logger.print(tag, F("\n\t sensor status changed - status: "));
			logger.print(tag, String(sensor->status));
		}

		unsigned long timeDiff = millis() - sensor->lastUpdateStatus;
		if (timeDiff > sensor->updateStatus_interval) {
			setEvent(F("SENSOR STATUS UPDATE TIMEOUT"));
			logger.println(tag, F("SENSOR STATUS UPDATE TIMEOUT "));
			logger.print(tag, F("\n\t sensor "));
			logger.print(tag, sensor->sensorid);
			logger.print(tag, F("."));
			logger.print(tag, sensor->sensorname);
			logger.print(tag, F("\n\t update status timeout"));
			sendUpdate = true;
		}

		if (sendUpdate) {
			Command command;
			int temptative = 0;
			do {
				logger.print(tag, F("\n\t send sensor status - temptative n."));
				logger.print(tag, temptative++);
				
				DynamicJsonBuffer jsonBuffer;
				JsonObject& json = jsonBuffer.createObject();
				sensor->getJson(json);
				//JsonObject& json = sensor->getJson();
				/*logger.print(tag, F("\n\t json="));
				logger.printJson(json);
				String jsonStr;
				json.printTo(jsonStr);*/
				bool res = command.sendSensorStatus(json);
				logger.print(tag, F("\n\t SENSOR STATUS SENT - res="));
				logger.print(tag, Logger::boolToString(res));
				if (res) {
					sensor->lastUpdateStatus = millis();
					break;
				}
				if (temptative > 2)
					break;
				else
					delay(1000);
			} while (1);
		}
	}
}

bool Shield::requestTime() {
	logger.print(tag, F("\n\t >>requestTimeFromServer"));
	setEvent(F("request server setting.."));
	timeNeedToBeUpdated = false;
	lastTimeRequest = millis();
	Command command;
	bool res = command.requestTime(getMACAddress());
	if (res)
		timeRequestInprogress = true;
	else
		timeRequestInprogress = false;
	logger.print(tag, F("\n\t <<requestTimeFromServer res="));
	logger.print(tag, Logger::boolToString(res));
	return res;
}

void Shield::checkTimeUpdateStatus() {
	unsigned long timediff;

	timediff = millis() - lastTimeRequest;
	if (timediff > timeSync_interval) {
		timeNeedToBeUpdated = true;
	}

	if (timeRequestInprogress && timediff > timeRequest_timeout) {
		timeNeedToBeUpdated = true;
	}

	if (timeNeedToBeUpdated && !timeRequestInprogress) {
		logger.println(tag, F("\n\n\n\-----------TIME UPDATE TIMEOUT --------\n\n"));
		setEvent(F("Request time"));
		bool res = requestTime();
		if (!res) { // se fallisce rirpova tra un minuto
			logger.println(tag, F("\n request setting failed"));
			lastTimeRequest = millis() - timeSync_interval + 1 * 60 * 1000;
		}
	}
}

